Revit 2024 API
Glazing.GlazingNoLevels Property
 The property labeled "Sheets of Glass" from the "Glazing" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018.1
Syntax
C#
public static string GlazingNoLevels { get; }
Visual Basic
Public Shared ReadOnly Property GlazingNoLevels As String
	Get
Visual C++
public:
static property String^ GlazingNoLevels {
	String^ get ();
}
Remarks
 This property is of type "AssetPropertyInteger" within the range of "1, 6".
See Also
Glazing Class
Autodesk.Revit.DB.Visual Namespace